SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/InformationRegisters/впИнтеграцияДокументов/впИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впИнтеграцияДокументов</name>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТОИР</name>
    <type>
      <types>DocumentRef.впЗаявкаНаРемонт</types>
      <types>DocumentRef.впПланГрафикРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЕРП</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	// ++ rarus PleA 04.12.2020 
	// переведено на типовой механизм проведения
	// оставлено на случай отладки и сравнения
	// + откл 
	//Движения.впЗаявкиНаСнабжение.Записывать = Истина;
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Основания", ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));
	//Запрос.УстановитьПараметр("ЗнС", Ссылка);
	//Запрос.УстановитьПараметр("Судно", Подразделение);
	//Запрос.УстановитьПараметр("ДатаЗаявки", Новый Граница(Дата, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("ID", IDремонта);

	//Для Каждого стрМат из МатериалыИРаботы Цикл
	//	Движение = Движения.впЗаявкиНаСнабжение.Добавить();
	//	ЗаполнитьЗначенияСвойств(Движение, стрМат);
	//	Движение.Период = МоментВремени().Дата;
	//	Если НЕ ДокументыОснования.Количество() = 0 Тогда
	//		Движение.ЗаявкаНаРемонт = ДокументыОснования[0].ДокументОснование;
	//	КонецЕсли;
	//	Если НЕ ПустаяСтрока(IDремонта) Тогда
	//		Движение.IDремонта = IDремонта;
	//	КонецЕсли;

	//КонецЦикла;
	//
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	//	
	//НачатьТранзакцию();	
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	впЗаявкаНаРемонтРемонтыОборудования.ID КАК ID,
	//               |	впЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК ДокументТОИР,
	//               |	&ЗнС КАК ДокументЕРП
	//               |ИЗ
	//               |	Документ.впЗаявкаНаРемонт.РемонтыОборудования КАК впЗаявкаНаРемонтРемонтыОборудования
	//               |ГДЕ
	//               |	впЗаявкаНаРемонтРемонтыОборудования.Ссылка В(&Основания) " + ?(НЕ ПустаяСтрока(IDремонта), "
	//               |	И впЗаявкаНаРемонтРемонтыОборудования.ID = &ID", "");
	//
	//  	Попытка
	//	
	//	БлокировкаДанных = Новый БлокировкаДанных;
	//	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.впИнтеграцияДокументов");
	//	ЭлементБлокировкиДанных.УстановитьЗначение("ДокументЕРП", Ссылка);
	//	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	//	БлокировкаДанных.Заблокировать();
	//	
	//	НаборЗаписей = РегистрыСведений.впИнтеграцияДокументов.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.ДокументЕРП.Установить(Ссылка);
	//	НаборЗаписей.Прочитать();
	//	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	//	НаборЗаписей.Записать();
	//	ЗафиксироватьТранзакцию();
	//	
	//Исключение
	//	
	//	ОтменитьТранзакцию();
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'впИнтеграцияДокументов'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	ВызватьИсключение;
	//	
	//КонецПопытки;
	//
	// - откл
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
		
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.впИнтеграцияДокументов");
		ЭлементБлокировкиДанных.УстановитьЗначение("ДокументЕРП", Ссылка);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.впИнтеграцияДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументЕРП.Установить(Ссылка);
		НаборЗаписей.Записать();
		
	Исключение
				
		ЗаписьЖурналаРегистрации(НСтр("ru = 'впИнтеграцияДокументов'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	// - откл
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.впЗаявкаНаРемонт") Тогда
		//Если НЕ ДанныеЗаполнения.Проведен Тогда
		//	ВызватьИсключение(НСтр("ru = 'Заказ не внутреннее потребление можно формировать только на основании проведенной заявки!'"));
		//КонецЕсли;
		//
		//Дата = ТекущаяДата();
		//Подразделение = ДанныеЗаполнения.Подразделение;
		//Организация = ДанныеЗаполнения.Организация;
		//Ответственный = Пользователи.ТекущийПользователь();
		//
		//ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения;
		//
		//
		//Для Каждого СтрокаТаблицы из ДанныеЗаполнения.МатериальныеЗатраты Цикл
		//	СтрокаДобавл = МатериалыИРаботы.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаДобавл, СтрокаТаблицы);
		//	СтрокаДобавл.ID = СтрокаТаблицы.ID
		//КонецЦикла;	
		//
		//Для Каждого СтрокаТаблицы из ДанныеЗаполнения.ЗапчастиРемонта Цикл
		//	СтрокаДобавл = МатериалыИРаботы.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаДобавл, СтрокаТаблицы);
		//	СтрокаДобавл.ID = СтрокаТаблицы.ID
		//КонецЦикла;	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("МассивСтрокНоменклатуры") 
		Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Для каждого Строка Из ДанныеЗаполнения.МассивСтрокНоменклатуры Цикл
			НС = МатериалыИРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Строка);
			Если ПустаяСтрока(НС.ID) Тогда
				НС.ID = Новый УникальныйИдентификатор();
			КонецЕсли;
		КонецЦикла; 
		// ++ rarus yukuzi 25.12.2020   // Снабжение ТОИР 2 Приоритет
		//ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения.Основание;
		Если ДанныеЗаполнения.Свойство("Основание") тогда
			ДокументыОснования.Добавить().ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;	
		// -- rarus yukuzi 25.12.2020

	КонецЕсли;
	
	ИнициализироватьЗначенияПоУмолчанию();
	
КонецПроцедуры

Процедура ИнициализироватьЗначенияПоУмолчанию()
	
	Подразделение = рарусЗаявкаНаСнабжениеСервер.ОсновноеСудно();
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = рарусЗаявкаНаСнабжениеСервер.ОсновнаяОрганизация();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьДоступностьРедактированияОбъекта(Отказ);
	
	рарусЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "МатериалыИРаботы");
	
	рарусЗаявкаНаСнабжениеСервер.УстановитьСтатусСогласованияПередЗаписью(ЭтотОбъект);
	
	рарусЗаявкаНаСнабжениеСервер.УстановитьОбластьСозданияДляНовогоОбъекта(ЭтотОбъект);
	
	//ПАН+
	Если ПолучитьФункциональнуюОпцию("рарусИспользуетсяСхемаСогласованияПоАналогам") Тогда
		рарусУчетАналогов.ОбновитьЗаписиРегистраЖурналИзмененийНоменклатурыПоАналогам(ЭтотОбъект);
		рарусУчетАналогов.ОбновитьСтрокиДокументаПоСтатусамСогласованияАналогов(ЭтотОбъект);		
	КонецЕсли;
	//ПАН-
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// ++ rarus PleA 26.10.2020 [ФТ.СНБ.01.01]
	//МатериалыИРаботы.Свернуть("Номенклатура, ДатаОтгрузки, ВариантОбеспечения, КодСтроки, Упаковка", "ID, Количество, КоличествоУпаковок");
	// -- rarus PleA
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ОбластьРедактирования = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаСудне();
	
	ОбластьСоздания = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаСудне();
	
	СтатусСогласования = рарусЗаявкаНаСнабжениеСервер.СтатусСогласованияНачальный();	
	
	НомерСудовойЗаявки = "";
	
	ДатаРегистрацииСудовойЗаявки = Дата(1,1,1);
	
	ОтветственныйБереговойСлужбы = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Для Каждого Строка Из МатериалыИРаботы цикл
		Строка.Доработать = Ложь;
		Строка.ПричинаДоработки = "";
		Строка.Отменено = Ложь;
	КонецЦикла;	
	
	// РаботаСФайламиСтрок
	рарусРаботаСФайламиСтрокСерверПереопределяемый.ПриКопировании(ЭтотОбъект);
	// Конец РаботаСФайламиСтрок
	
	рарусХранениеВерсий.ОчиститьРеквизитыВерсий(ЭтотОбъект);
	
	//ПАН+
	рарусУчетАналогов.ОчисткаУстановкаРеквизитовУчетаАналоговПриКопировании(ЭтотОбъект);
	//ПАН-
КонецПроцедуры

Процедура ПроверитьДоступностьРедактированияОбъекта(Отказ)
	
	Если Не рарусСостоянияРедактированияОбъектов.ОбъектДоступенДляРедактирования(Ссылка) тогда
		Отказ = Истина;
	КонецЕсли;	
	
	Если Отказ тогда
		ОбщегоНазначения.СообщитьПользователю("Объект не доступен для редактирования");
	КонецЕсли;	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// ++ rarus makole 2021-05-11 [РАIT-0023284]
	
	// ++ rarus makole 2021-07-28 [ВПIT-0028068]
	// В Судовом модуле,  в документе Заявка на снабжение при указании вида потребности Продукты питания  
	// и Навигационные карты (в случае учета навигационных карт как услуга) необходимо убрать  поля Береговая служба и Заголовок
	
	//Если ВидПотребности = рарусЗаявкаНаСнабжениеСервер.ВидПотребностиТМЦЗаСчетСобственныхСредств() Тогда
		//ПроверяемыеРеквизиты.Удалить("БереговаяСлужба");
		//ПроверяемыеРеквизиты.Удалить("Заголовок");
		
	ЭтоЗаказПродуктов = ВидПотребности = рарусЗаявкаНаСнабжениеСервер.ВидПотребностиПродуктыПитания();
	ЭтоЗаказКартНавигации = (ВидПотребности = рарусЗаявкаНаСнабжениеСервер.ВидПотребностиНавигационныеКарты()) И ПолучитьФункциональнуюОпцию("рарусУчетКартНавигацииКакУслуги");
	ЭтоЗаказЗаСчетСобственныхСредств = ВидПотребности = рарусЗаявкаНаСнабжениеСервер.ВидПотребностиТМЦЗаСчетСобственныхСредств();
	
	УдалитьБСИЗаголовок = ЭтоЗаказПродуктов ИЛИ ЭтоЗаказКартНавигации ИЛИ ЭтоЗаказЗаСчетСобственныхСредств;
	
	Если УдалитьБСИЗаголовок Тогда
		МассивНепроверяемыхРеквизитов = Новый Массив ;
		МассивНепроверяемыхРеквизитов.Добавить("БереговаяСлужба");
		МассивНепроверяемыхРеквизитов.Добавить("Заголовок");
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	// -- rarus makole 2021-07-28 [ВПIT-0028068]
	КонецЕсли;
	// -- rarus makole 2021-05-11 [РАIT-0023284]
КонецПроцедуры

#КонецЕсли
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры
